In [ ]:
#Question1
How to import pandas and check the version?

In [1]:
import pandas as pd
print(pd.__version__)

1.1.4

In [ ]:
#Question 2
How to create a series from a numpy array

In [2]:
import numpy as np

arr = np.array([5,6,2,8,10,6,9])
s = pd.Series(arr)
print(s)

0     5
1     6
2     2
3     8
4    10
5     6
6     9
dtype: int64

In [ ]:
#Question 3
How to convert the index of a series into a column of a dataframe?

In [3]:
data = pd.DataFrame({'Roll Number': ['20CSE29', '20CSE49', '20CSE36', '20CSE44'], 
                     'Name': ['Amelia', 'Sam', 'Dean', 'Jessica'], 
                     'Marks In Percentage': [97, 90, 70, 82], 
                     'Grade': ['A', 'A', 'C', 'B']})
data

  Roll Number     Name  Marks In Percentage Grade
0     20CSE29   Amelia                   97     A
1     20CSE49      Sam                   90     A
2     20CSE36     Dean                   70     C
3     20CSE44  Jessica                   82     B

In [4]:
data["index"] = data.index

data

  Roll Number     Name  Marks In Percentage Grade  index
0     20CSE29   Amelia                   97     A      0
1     20CSE49      Sam                   90     A      1
2     20CSE36     Dean                   70     C      2
3     20CSE44  Jessica                   82     B      3

In [ ]:
#Question 4
Write the code to list all the datasets available in seaborn library.
Load the 'mpg' dataset
Note: mpg dataset will be read from seaborn module in the manner sir has already shown(provided in the
materials folder)

In [5]:
import seaborn as sns
mpg = sns.load_dataset('mpg')
mpg

      mpg  cylinders  ...  origin                       name
0    18.0          8  ...     usa  chevrolet chevelle malibu
1    15.0          8  ...     usa          buick skylark 320
2    18.0          8  ...     usa         plymouth satellite
3    16.0          8  ...     usa              amc rebel sst
4    17.0          8  ...     usa                ford torino
..    ...        ...  ...     ...                        ...
393  27.0          4  ...     usa            ford mustang gl
394  44.0          4  ...  europe                  vw pickup
395  32.0          4  ...     usa              dodge rampage
396  28.0          4  ...     usa                ford ranger
397  31.0          4  ...     usa                 chevy s-10

[398 rows x 9 columns]

In [ ]:
#Question 5
Which country origin cars are a part of this dataset?

In [6]:
mpg['origin'].value_counts()

usa       249
japan      79
europe     70
Name: origin, dtype: int64

In [ ]:
#Question 6
Extract the part of the dataframe which contains cars belonging to 'usa

In [7]:
mpg[mpg.origin == 'usa']

      mpg  cylinders  ...  origin                       name
0    18.0          8  ...     usa  chevrolet chevelle malibu
1    15.0          8  ...     usa          buick skylark 320
2    18.0          8  ...     usa         plymouth satellite
3    16.0          8  ...     usa              amc rebel sst
4    17.0          8  ...     usa                ford torino
..    ...        ...  ...     ...                        ...
392  27.0          4  ...     usa           chevrolet camaro
393  27.0          4  ...     usa            ford mustang gl
395  32.0          4  ...     usa              dodge rampage
396  28.0          4  ...     usa                ford ranger
397  31.0          4  ...     usa                 chevy s-10

[249 rows x 9 columns]